apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_uart.h
#define UART_CTL_LBE               (1 << 7)  /* Bit 7:  UART Loop Back Enable */
#define UART_CTL_TXE               (1 << 8)  /* Bit 8:  UART Transmit Enable */
#define UART_CTL_RXE               (1 << 9)  /* Bit 9:  UART Receive Enable */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_CTL_DTR             (1 << 10) /* Bit 10: Data Terminal Ready */
#  define UART_CTL_RTS             (1 << 11) /* Bit 11: Request to Send */
#  define UART_CTL_RTSEN           (1 << 14) /* Bit 14: Enable Request to Send */
#  define UART_CTL_CTSEN           (1 << 15) /* Bit 15: Enable Clear To Send */
#endif

/* UART Interrupt FIFO Level Select (IFLS) */

#define UART_IFLS_TXIFLSEL_SHIFT   0         /* Bits 2-0: UART Transmit Interrupt FIFO Level Select */
#define UART_IFLS_TXIFLSEL_MASK    (7 << UART_IFLS_TXIFLSEL_SHIFT)
#  define UART_IFLS_TXIFLSEL_18th  (0 << UART_IFLS_TXIFLSEL_SHIFT) /* 1/8th full */
#  define UART_IFLS_TXIFLSEL_14th  (1 << UART_IFLS_TXIFLSEL_SHIFT) /* 1/4th full */
#  define UART_IFLS_TXIFLSEL_half  (2 << UART_IFLS_TXIFLSEL_SHIFT) /* half full */
#  define UART_IFLS_TXIFLSEL_34th  (3 << UART_IFLS_TXIFLSEL_SHIFT) /* 3/4th full */
#  define UART_IFLS_TXIFLSEL_78th  (4 << UART_IFLS_TXIFLSEL_SHIFT) /* 7/8th full */
#define UART_IFLS_RXIFLSEL_SHIFT   3         /* Bits 5-3: UART Receive Interrupt FIFO Level Select */
#define UART_IFLS_RXIFLSEL_MASK    (7 << UART_IFLS_RXIFLSEL_SHIFT)
#  define UART_IFLS_RXIFLSEL_18th  (0 << UART_IFLS_RXIFLSEL_SHIFT) /* 1/8th full */
#  define UART_IFLS_RXIFLSEL_14th  (1 << UART_IFLS_RXIFLSEL_SHIFT) /* 1/4th full */
#  define UART_IFLS_RXIFLSEL_half  (2 << UART_IFLS_RXIFLSEL_SHIFT) /* half full */
#  define UART_IFLS_RXIFLSEL_34th  (3 << UART_IFLS_RXIFLSEL_SHIFT) /* 3/4th full */
#  define UART_IFLS_RXIFLSEL_78th  (4 << UART_IFLS_RXIFLSEL_SHIFT) /* 7/8th full */

/* UART Interrupt Mask (IM) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_IM_RIIM             (1 << 0)  /* Bit 0:  UART Ring Indicator Modem Interrupt Mask */
#  define UART_IM_CTSIM            (1 << 1)  /* Bit 1:  UART Clear to Send Modem Interrupt Mask */
#  define UART_IM_DCDIM            (1 << 2)  /* Bit 2:  UART Data Carrier Detect Modem Interrupt Mask */
#  define UART_IM_DSRIM            (1 << 3)  /* Bit 3:  UART Data Set Ready Modem Interrupt Mask */
#endif

#define UART_IM_RXIM               (1 << 4)  /* Bit 4:  UART Receive Interrupt Mask */
#define UART_IM_TXIM               (1 << 5)  /* Bit 5:  UART Transmit Interrupt Mask */
#define UART_IM_RTIM               (1 << 6)  /* Bit 6:  UART Receive Time-Out Interrupt Mask */
#define UART_IM_FEIM               (1 << 7)  /* Bit 7:  UART Framing Error Interrupt Mask */
#define UART_IM_PEIM               (1 << 8)  /* Bit 8:  UART Parity Error Interrupt Mask */
#define UART_IM_BEIM               (1 << 9)  /* Bit 9:  UART Break Error Interrupt Mask */
#define UART_IM_OEIM               (1 << 10) /* Bit 10: UART Overrun Error Interrupt Mask */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_IM_EOTIM            (1 << 11) /* Bit 11: End of Transmission Interrupt Mask */
#  define UART_IM_9BITIM           (1 << 12) /* Bit 12: 9-Bit Mode Interrupt Mask */
#  define UART_IM_DMARXIM          (1 << 16) /* Bit 16: Receive DMA Interrupt Mask */
#  define UART_IM_DMATXIM          (1 << 17) /* Bit 17: Transmit DMA Interrupt Mask */
#endif

/* UART Raw Interrupt Status (RIS) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_RIS_RIIS            (1 << 0)  /* Bit 0:  UART Ring Indicator Modem Raw Interrupt Status */
#  define UART_RIS_CTSIS           (1 << 1)  /* Bit 1:  UART Clear to Send Modem Raw Interrupt Status */
#  define UART_RIS_DCDIS           (1 << 2)  /* Bit 2:  UART Data Carrier Detect Modem Raw Interrupt Status */
#  define UART_RIS_DSRIS           (1 << 3)  /* Bit 3:  UART Data Set Ready Modem Raw Interrupt Status */
#endif

#define UART_RIS_RXRIS             (1 << 4)  /* Bit 4:  UART Receive Raw Interrupt Status */
#define UART_RIS_TXRIS             (1 << 5)  /* Bit 5:  UART Transmit Raw Interrupt Status */
#define UART_RIS_RTRIS             (1 << 6)  /* Bit 6:  UART Receive Time-Out Raw Interrupt Status */
#define UART_RIS_FERIS             (1 << 7)  /* Bit 7:  UART Framing Error Raw Interrupt Status */
#define UART_RIS_PERIS             (1 << 8)  /* Bit 8:  UART Parity Error Raw Interrupt Status */
#define UART_RIS_BERIS             (1 << 9)  /* Bit 9:  UART Break Error Raw Interrupt Status */
#define UART_RIS_OERIS             (1 << 10) /* Bit 10: UART Overrun Error Raw Interrupt Status */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_RIS_EOTIS           (1 << 11) /* Bit 11: End of Transmission Raw Interrupt Status */
#  define UART_RIS_9BITIS          (1 << 12) /* Bit 12: 9-Bit Mode Raw Interrupt Status */
#  define UART_RIS_DMARXIS         (1 << 16) /* Bit 16: Receive DMA Raw Interrupt Status */
#  define UART_RIS_DMATXIS         (1 << 17) /* Bit 17: Transmit DMA Raw Interrupt Status */
#endif

/* UART Masked Interrupt Status (MIS) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_MIS_RIIS            (1 << 0)  /* Bit 0:  UART Ring Indicator Modem Masked Interrupt Status */
#  define UART_MIS_CTSIS           (1 << 1)  /* Bit 1:  UART Clear to Send Modem Masked Interrupt Status */
#  define UART_MIS_DCDIS           (1 << 2)  /* Bit 2:  UART Data Carrier Detect Modem Masked Interrupt Status */
#  define UART_MIS_DSRIS           (1 << 3)  /* Bit 3:  UART Data Set Ready Modem Masked Interrupt Status */
#endif

#define UART_MIS_RXMIS             (1 << 4)  /* Bit 4:  UART Receive Masked Interrupt Status */
#define UART_MIS_TXMIS             (1 << 5)  /* Bit 5:  UART Transmit Masked Interrupt Status */
#define UART_MIS_RTMIS             (1 << 6)  /* Bit 6:  UART Receive Time-Out Masked Interrupt Status */
#define UART_MIS_FEMIS             (1 << 7)  /* Bit 7:  UART Framing Error Masked Interrupt Status */
#define UART_MIS_PEMIS             (1 << 8)  /* Bit 8:  UART Parity Error Masked Interrupt Status */
#define UART_MIS_BEMIS             (1 << 9)  /* Bit 9:  UART Break Error Masked Interrupt Status */
#define UART_MIS_OEMIS             (1 << 10) /* Bit 10: UART Overrun Error Masked Interrupt Status */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_MIS_EOTIS           (1 << 11) /* Bit 11: End of Transmission Masked Interrupt Status */
#  define UART_MIS_9BITIS          (1 << 12) /* Bit 12: 9-Bit Mode Masked Interrupt Status */
#  define UART_MIS_DMARXIS         (1 << 16) /* Bit 16: Receive DMA Masked Interrupt Status */
#  define UART_MIS_DMATXIS         (1 << 17) /* Bit 17: Transmit DMA Masked Interrupt Status */
#endif

/* UART Interrupt Clear (ICR) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_ICR_RIIC            (1 << 0)  /* Bit 0:  UART Ring Indicator Modem Interrupt Clear */
#  define UART_ICR_CTSIC           (1 << 1)  /* Bit 1:  UART Clear to Send Modem Interrupt Clear */
#  define UART_ICR_DCDIC           (1 << 2)  /* Bit 2:  UART Data Carrier Detect Modem Interrupt Clear */
#  define UART_ICR_DSRIC           (1 << 3)  /* Bit 3:  UART Data Set Ready Modem Interrupt Clear */
#endif

#define UART_ICR_RXIC              (1 << 4)  /* Bit 4:  Receive Interrupt Clear */
#define UART_ICR_TXIC              (1 << 5)  /* Bit 5:  Transmit Interrupt Clear */
#define UART_ICR_RTIC              (1 << 6)  /* Bit 6:  Receive Time-Out Interrupt Clear */
#define UART_ICR_FEIC              (1 << 7)  /* Bit 7:  Framing Error Interrupt Clear */
#define UART_ICR_PEIC              (1 << 8)  /* Bit 8:  Parity Error Interrupt Clear */
#define UART_ICR_BEIC              (1 << 9)  /* Bit 9:  Break Error Interrupt Clear */
#define UART_ICR_OEIC              (1 << 10) /* Bit 10: Overrun Error Interrupt Clear */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_ICR_EOTIC           (1 << 11) /* Bit 11: End of Transmission Interrupt Clear */
#  define UART_ICR_9BITIC          (1 << 12) /* Bit 12: 9-Bit Mode Interrupt Clear */
#  define UART_ICR_DMARXIC         (1 << 16) /* Bit 16: Receive DMA Interrupt Clear */
#  define UART_ICR_DMATXIC         (1 << 17) /* Bit 17: Transmit DMA Interrupt Clear */
#endif

