apache/nuttx/arch/arm/src/tiva/hardware/tm4c/tm4c_uart.h
/* UART DMA Control (DMACTL) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_DMACTL_RXDMAE       (1 << 0)  /* Bit 0:  Receive DMA Enable */
#  define UART_DMACTL_TXDMAE       (1 << 1)  /* Bit 1:  Transmit DMA Enable */
#  define UART_DMACTL_DMAERR       (1 << 2)  /* Bit 2:  DMA on Error */
#endif

/* UART 9-Bit Self Address (9BITADDR) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_9BITADDR_ADDR_SHIFT (0)       /* Bits 0-7: Self Address for 9-Bit Mode */
#  define UART_9BITADDR_ADDR_MASK  (0xff << UART_9BITADDR_ADDR_SHIFT)
#    define UART_9BITADDR_ADDR(n)  ((uint32_t)(n) << UART_9BITADDR_ADDR_SHIFT)
#  define UART_9BITADDR_9BITEN     (1 << 15) /* Bit 15: Enable 9-Bit Mode */
#endif

/* UART 9-Bit Self Address Mask (9BITAMASK) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_9BITAMASK_MASK_SHIFT (0)       /* Bits 0-7: Self Address Mask for 9-Bit Mode */
#  define UART_9BITAMASK_MASK_MASK  (0xff << UART_9BITAMASK_MASK_SHIFT)
#endif

/* UART Peripheral Properties (PP) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_PP_SC               (1 << 0)  /* Bit 0:  Smart Card Support */
#  define UART_PP_NB               (1 << 1)  /* Bit 1:  9-Bit Support */
#  define UART_PP_MS               (1 << 2)  /* Bit 2:  Modem Support */
#  define UART_PP_MSE              (1 << 3)  /* Bit 3:  Modem Support Extended */
#endif

/* UART Clock Configuration (CC) */

#if defined(CONFIG_ARCH_CHIP_TM4C129)
#  define UART_CC_CS_SHIFT         (0)       /* Bit 0-3: UART Baud Clock Source */
#  define UART_CC_CS_MASK          (15 << UART_CC_CS_SHIFT)
#    define UART_CC_CS_SYSCLK      (0 << UART_CC_CS_SHIFT) /* System clock in RSCLKCFG */
#    define UART_CC_CS_ALTSRC      (5 << UART_CC_CS_SHIFT) /* Alternate source in ALTCLKCFG */
#endif

/* UART Peripheral Identification 4 (PERIPHID4) */

#define UART_PERIPHID4_MASK        (0xff)    /* UART Peripheral ID Register[7:0] */

/* UART Peripheral Identification 5 (UARTPERIPHID5 */

#define UART_PERIPHID5_MASK        (0xff)    /* UART Peripheral ID Register[15:8] */

/* UART Peripheral Identification 6 (UARTPERIPHID6) */

#define UART_PERIPHID6_MASK        (0xff)    /* UART Peripheral ID Register[23:16] */

/* UART Peripheral Identification 7 (UARTPERIPHID7) */

#define UART_PERIPHID7_MASK        (0xff)    /* UART Peripheral ID Register[31:24] */

/* UART Peripheral Identification 0 (UARTPERIPHID0) */

#define UART_PERIPHID0_MASK        (0xff)    /* UART Peripheral ID Register[7:0] */

/* UART Peripheral Identification 1 (UARTPERIPHID1) */

#define UART_PERIPHID1_MASK        (0xff)    /* UART Peripheral ID Register[15:8] */

/* UART Peripheral Identification 2 (UARTPERIPHID2) */

#define UART_PERIPHID2_MASK        (0xff)    /* UART Peripheral ID Register[23:16] */

/* UART Peripheral Identification 3 (UARTPERIPHID3) */

#define UART_PERIPHID3_MASK        (0xff)    /* UART Peripheral ID Register[31:24] */

/* UART PrimeCell Identification 0 (CELLID0) */

#define UART_CELLID0_MASK          (0xff)    /* UART PrimeCell ID Register[7:0] */

/* UART PrimeCell Identification 1 (UARTPCELLID1) */

#define UART_CELLID1_MASK          (0xff)    /* UART PrimeCell ID Register[15:8] */

/* UART PrimeCell Identification 2 (UARTPCELLID2) */

#define UART_CELLID02MASK          (0xff)    /* UART PrimeCell ID Register[23:16] */

/* UART PrimeCell Identification 3 (UARTPCELLID3) */

#define UART_CELLID3_MASK          (0xff)    /* UART PrimeCell ID Register[31:24] */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_TM4C_TM4C_UART_H */
